month = int(input("Введите порядковый номер месяца (от 1 до 12): "))
season = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето",
          9: "осень", 10: "осень", 11: "осень", 12: "зима"}
list_month = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]

for i in season.keys():
    if i == month:
        s = season.get(i)
        print(f"введенному номеру месяца соответствует {s}")

print(f"{list_month[month - 1]} - лучший сезон года")
